{
    "projects": [
        {
            "id":1,
            "name":"BOOKI",
            "image":"assets/booki.png" ,
            "description": "Dévelopement d’un site internet permettant aux usagers de trouver des hébérgements et des activités dans la ville de leur choix.",
            "description-modal":"Développement de la page d'accueil d'une agence de voyage avec HTML et CSS, en intégrant une interface responsive. Utilisation des maquettes Figma pour mobile, tablette et desktop pour assurer une intégration précise.Garantie d'une expérience utilisateur optimale sur tous les appareils et toutes les tailles d'écran grâce à une conception responsive de la page d'accueil.",
            "year":2023,
            "category":"Développement web",
            "langages":[
                {
                  "langage":"HTML",
                  "icone":"./assets/html.png"
                },
                {
                  "langage":"CSS",
                  "icone":"./assets/css.png"
                }

            ],
            "website": "https://www.google.fr/", 

            "liens": [
                {
                  "icone": "./assets/Github-icon.png",
                  "url": "https://github.com/CAMARA04/OC-Projet2-BOOKI.git",
                  "lien vers":"Git-hub"
                }
               
              ]

        },

        {
            "id":2,
            "name":"MON VIEUX GRIMOIRE",
            "image":"assets/Mon-vieux-grimoire.png" ,
            "description": "Développemnt de la partie Bac-kend pour une librairie ayant la volonté d’ouvrir un site de référencement et de notation de livres.",
            "description-modal":"Développement du back-end d'un site de notation de livres avec Express et MongoDB. Création d'un serveur et connexion à la base de données. Implémentation des modèles de données et des opérations CRUD pour la gestion des livres et des notations, avec un accent sur la sécurité des données. Mise en place d'un système d'authentification sécurisé pour les utilisateurs. Gestion du téléchargement et de l'optimisation des images, ajout de fonctionnalités pour noter les livres et calculer la note moyenne. Respect des bonnes pratiques du Green Code pour réduire l'empreinte écologique du site. Utilisation de Mongoose pour modéliser les données MongoDB et adoption d'une architecture MVC pour structurer l'application.",
            "year":2024,
            "category":"Développement web",
            "langages":[
              {
                "langage":"HTML",
                "icone":"./assets/html.png"
              },
              {
                "langage":"CSS",
                "icone":"./assets/css.png"
              },

              {
                "langage":"MONGO DB",
                "icone":"./assets/Mongodb-PNG-Pic.png"
              },

              {
                "langage":"JAVASCRIPT",
                "icone":"./assets/js.png"
              }


          ],
            "website": "https://www.google.fr/",
            
            "liens": [
                {
                  "icone": "./assets/Github-icon.png",
                  "url": "https://github.com/CAMARA04/OC_Mon_Vieux_Grimoire.git",
                  "lien vers":"Git-hub"
                }
               
              ]

        },

        {
            "id":3,
            "name":"SOPHIE BLUEL",
            "image":"assets/SOPHIE -BLUEL.jpg" ,
            "description": "Mission front-end pour la conception du site portfolio d'une architecte d’intérieur.Création d'une page web web dynamique en utilisant JavaScript et en communiquant avec une API.",
            "description-modal":"Développement d'une page web dynamique pour une architecte d'intérieur, utilisant JavaScript et une API. Gestion du Front-End, incluant la présentation des travaux de l'architecte avec HTML et JavaScript. Création d'une page de connexion pour l'administrateur et d'une modale pour l'upload de médias.",
            "year":2023,
            "category":"Développement web",
            "langages":[
              {
                "langage":"HTML",
                "icone":"./assets/html.png"
              },
              {
                "langage":"CSS",
                "icone":"./assets/css.png"
              },

              {
                "langage":"JAVASCRIPT",
                "icone":"./assets/js.png"
              }

          ],
            "website": "https://www.google.fr/",
            
            "liens": [
                {
                  "icone": "./assets/Github-icon.png",
                  "url": "https://github.com/CAMARA04/Portfolio-architecte-sophie-bluel.git",
                  "lien vers":"Git-hub"
                }
               
              ]
        },

        {
            "id":4,
            "name":"NINA CARDUCCI",
            "image":"assets/nina-carducci.jpg" ,
            "description": "Optimisation SEO du site d’une photographe dans le but de gagner en performance et aussi améliorer l’expérience utilisateur.",
            "description-modal":"J'ai optimisé le référencement d'un site en améliorant sa performance et son accessibilité. Après une analyse approfondie des problèmes de chargement et de référencement, j'ai formulé des recommandations pour améliorer la vitesse de chargement, la structure du code et le référencement. En appliquant ces recommandations, j'ai réussi à optimiser les performances et l'accessibilité du site afin d'améliorer son classement sur les moteurs de recherche. J'ai également rédigé un rapport détaillé illustrant les résultats avant et après les modifications, mettant en évidence les changements apportés et leur impact sur le référencement et l'accessibilité du site.",
            "year":2023,
            "category":"Développement web",
            "langages":[
                
              {
                "langage":"HTML",
                "icone":"./assets/html.png"
              },

              {
                "langage":"CSS",
                "icone":"./assets/css.png"
              },

              {
                "langage":"Lighthouse",
                "icone":"./assets/lighthouse.png"
              }
              
               

            ],
            "website": "",

            "liens": [
                {
                  "icone": "./assets/Github-icon.png",
                  "url": "https://github.com/CAMARA04/Optimisation-site-Nina-Carducci.git",
                  "lien vers":"Git-hub"
                }
               
              ]
        },

        {

            "id":5,
            "name":"KASA",
            "image":"./assets/KASA.png" ,
            "description": "Impmémentation du front-end d'une application en utilisant React et React Router pour creer une expérience utilisateur moderne et réactive.Dans ce projet j'ai eu l'occasion de travailler sur la logique de présentation des données et les composants React.Nous avons le résultat d'une application web interactive et visuellement attrayante!",
            "description-modal":"Dans ce projet, j'ai implémenté le front-end d'une application en utilisant React et React Router pour offrir une expérience utilisateur moderne et réactive. J'ai configuré la navigation entre les différentes pages de l'application avec React Router, ce qui a permis de gérer efficacement le routage dans une application web moderne.Le développement s'est concentré exclusivement sur le front-end, en se basant sur des maquettes et en utilisant des données extraites d'un fichier JSON. J'ai initiéle projet avec Create React App pour simplifier la configuration initiale de l'application React, et j'ai également utilisé Node.js pour exécuter du code JavaScript en dehors du navigateur.",
            "year":2024,
            "category":"Développement web",
            "langages":[
              {
                "langage":"HTML",
                "icone":"./assets/html.png"
              },
              {
                "langage":"SASS",
                "icone":"./assets/SASS.png"
              },

              {
                "langage":"REACT",
                "icone":"./assets/react.png"
              },

              {
                "langage":"JAVASCRIPT",
                "icone":"./assets/js.png"
              },

              {
                "langage":"Node JS",
                "icone":"./assets/Node_JS.png"
              }


          ],
            "website": "",

            "liens": [
                {
                  "icone": "./assets/Github-icon.png",
                  "url": "https://github.com/CAMARA04/Plateforme-Web-Kasa.git",
                  "lien vers":"Git-hub"
                }
               
              ]
          },


          {

            "id":6,
            "name":"QWENTA",
            "image":"./assets/Qwenta.png" ,
            "description": "Cette mission consistait à mener, préparer et planifier le projet de développement du site de Qwenta grâce à la méthodologie de travail agile.L'objectif était de développer un 'Menu Maker'permettant aux restaurateurs d'afficher et de mettre en page leurs menus facilement, en quelques clics.",
            "description-modal":"Dans ce projet, j'ai pris en charge la planification du développement d'un site web.J'ai mené une veille technologique afin de rester informé des dernières tendances et technologies pertinentes pour le projet, utilisant un système de veille pour suivre les évolutions dans le domaine du développement web.Mon rôle principal a été de rédiger les spécifications techniques du projet, en identifiant les besoins fonctionnels et en décomposant les fonctionnalités en tâches spécifiques.Pour organiser le projet et assurer un suivi structuré et efficace, j'ai utilisé L'outil de gestion de projet Notion, où j'ai créé un tableau Kanban pour visualiser le déroulement du projet.",
            "year":2023,
            "category":"Développement web",
            "langages":[
              {
                "langage":"METHODOLOGIE AGILE",
                "icone":"./assets/Agile-method.png"
              }
              

          ],
            "website": "",

            "liens": [
                {
                  "icone": "",
                  "url": "",
                  "lien vers":""
                }
               
              ]
          }
        ]
  }
